import React, { useState, useEffect } from 'react'
import { useDevice } from 'vtex.device-detector'

import style from './styles.css'

export function Countdown({ targetDate, url }) {
  const { isMobile } = useDevice()
  const useCountdown = (data) => {
    const [tempoRestante, setTempoRestante] = useState(null)

    useEffect(() => {
      const [dia, mes, ano] = data.split('/')

      // Força 23:59:59 no fuso horário de Brasília
      const dataEvento = new Date(
        `${ano}-${mes}-${dia}T23:59:59-03:00`
      ).getTime()

      const atualizarTempoRestante = () => {
        const dataAtual = new Date().getTime()
        const intervalo = dataEvento - dataAtual

        if (intervalo <= 0) {
          setTempoRestante({ dias: 0, horas: 0, minutos: 0, segundos: 0 })

          return
        }

        const segundo = 1000
        const minuto = segundo * 60
        const hora = minuto * 60
        const diaMs = hora * 24

        const dias = Math.floor(intervalo / diaMs)
        const horas = Math.floor((intervalo % diaMs) / hora)
        const minutos = Math.floor((intervalo % hora) / minuto)
        const segundos = Math.floor((intervalo % minuto) / segundo)

        setTempoRestante({ dias, horas, minutos, segundos })
      }

      atualizarTempoRestante()
      const intervaloId = setInterval(atualizarTempoRestante, 1000)

      return () => clearInterval(intervaloId)
    }, [data])

    return tempoRestante
  }

  const tempoRestante = useCountdown(targetDate || '30/11/2025')

  return (
    <a href={url ?? '/black-friday'} className={`${style.contentCronometro}`}>
      <div className={`${style.cronometroEvento}`}>
        <div className={`${style.cronometroEventoBlocoEsquerda}`}>
          <svg width="202" height="40" viewBox="0 0 202 40" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M18.8593 25.4148H14.1105V16.5131C14.1105 15.2461 13.6506 14.1574 12.7309 13.2424C11.8111 12.3273 10.7178 11.8675 9.44609 11.8675C8.17441 11.8675 7.04351 12.3179 6.12377 13.2236C5.20403 14.1293 4.74886 15.2226 4.74886 16.5131V25.4148H0V16.5272C0 13.9275 0.919738 11.7173 2.76391 9.8872C4.60808 8.0618 6.82765 7.14675 9.43201 7.14675C12.0364 7.14675 14.2653 8.07588 16.1189 9.92943C17.9724 8.07588 20.2014 7.14675 22.8058 7.14675C25.4101 7.14675 27.6344 8.0618 29.4739 9.8872C31.3134 11.7126 32.2378 13.9275 32.2378 16.5272V25.4148H27.4889V16.5131C27.4889 15.2226 27.0338 14.1246 26.1328 13.2236C25.2318 12.3226 24.1338 11.8675 22.8433 11.8675C21.1071 11.8675 19.7838 12.6042 18.8687 14.087V25.4195L18.8593 25.4148Z" fill="white"/>
            <path d="M52.092 25.4148L51.0971 22.6697C49.2201 24.8752 46.8269 25.9779 43.9175 25.9779C41.9232 25.9779 40.1213 25.4148 38.5164 24.2886C36.9069 23.1624 35.7666 21.6608 35.0862 19.7838C34.7108 18.7749 34.5231 17.7097 34.5231 16.5835C34.5231 14.5891 35.0862 12.7872 36.2124 11.1823C37.3386 9.5775 38.8402 8.43252 40.7172 7.7521C41.7965 7.35323 42.8758 7.15145 43.9551 7.15145C45.9494 7.15145 47.7514 7.71925 49.3562 8.85954C50.9611 9.99513 52.106 11.5061 52.7865 13.3832L57.1505 25.4195H52.0967L52.092 25.4148ZM41.2756 20.4126C42.0734 20.9757 42.9509 21.2619 43.9175 21.2619C45.208 21.2619 46.3107 20.8068 47.2258 19.9011C48.1408 18.9954 48.596 17.8927 48.596 16.5975C48.596 14.9739 47.925 13.6882 46.5876 12.7497C45.7899 12.21 44.8983 11.9378 43.9129 11.9378C42.2705 11.9378 41.0035 12.5995 40.1119 13.9181C39.5488 14.744 39.2672 15.6356 39.2672 16.6022C39.2672 18.2259 39.9383 19.4975 41.2756 20.4173" fill="white"/>
            <path d="M78.2951 16.5084C78.2951 19.1831 77.3238 21.4356 75.3717 23.2656C77.3191 25.1192 78.2951 27.3951 78.2951 30.0933C78.2951 33.4719 76.9108 36.0763 74.1422 37.9064C72.5233 38.9622 70.773 39.4878 68.9006 39.4878C65.5455 39.4878 62.9411 38.0894 61.0875 35.2973C60.0083 33.7019 59.4686 31.9656 59.4686 30.0886C59.4686 28.8685 59.7032 27.6954 60.1725 26.5692L64.5694 28.3383C64.3348 28.9061 64.2175 29.4926 64.2175 30.1074C64.2175 31.4025 64.682 32.5053 65.6065 33.4109C66.5309 34.3166 67.629 34.7718 68.8959 34.7718C70.1629 34.7718 71.2563 34.3119 72.1713 33.3875C73.0864 32.463 73.5416 31.365 73.5416 30.0886C73.5416 28.0098 72.5702 26.5551 70.6275 25.7245C70.0409 25.8653 69.459 25.9357 68.8725 25.9357C66.2493 25.9357 64.0251 25.0207 62.2044 23.1906C60.379 21.3605 59.4639 19.1315 59.4639 16.5037C59.4639 13.8759 60.379 11.6844 62.2138 9.85435C64.0485 8.02426 66.2634 7.10922 68.8584 7.10922L71.6035 0.595963L75.3623 2.19142L72.8658 8.01957C74.5176 8.8173 75.8362 9.97636 76.817 11.5014C77.7977 13.0265 78.2904 14.6924 78.2904 16.499M73.5463 16.5272C73.5463 15.2555 73.0911 14.1621 72.176 13.2424C71.261 12.3226 70.1676 11.8628 68.9006 11.8628C67.6336 11.8628 66.5074 12.3179 65.5924 13.2236C64.6773 14.1293 64.2222 15.232 64.2222 16.5272C64.2222 17.8223 64.6773 18.9297 65.5924 19.8495C66.5074 20.7692 67.6102 21.2291 68.9006 21.2291C70.1911 21.2291 71.2891 20.7692 72.1901 19.8495C73.0911 18.9297 73.5463 17.8223 73.5463 16.5272Z" fill="white"/>
            <path d="M80.0548 3.10178C80.0548 2.30405 80.3317 1.63771 80.8807 1.09337C81.4297 0.553731 82.1055 0.286255 82.9032 0.286255C83.7009 0.286255 84.3391 0.563112 84.8928 1.11214C85.4465 1.66586 85.7187 2.32751 85.7187 3.10178C85.7187 3.87605 85.4465 4.57524 84.9116 5.12427C84.372 5.67799 83.7009 5.95016 82.9032 5.95016C82.1055 5.95016 81.4297 5.6733 80.8807 5.12427C80.3317 4.57524 80.0548 3.89951 80.0548 3.10178ZM80.5475 7.15145H85.2964V25.4148H80.5475V7.15145Z" fill="white"/>
            <path d="M103.494 23.3032C101.664 25.0629 99.496 25.9404 96.9855 25.9404C94.475 25.9404 92.1287 25.0254 90.2986 23.1953C88.4685 21.3652 87.5535 19.1362 87.5535 16.5084C87.5535 13.8806 88.4732 11.6891 90.3174 9.85904C92.1615 8.02895 94.3811 7.11391 96.9855 7.11391C99.3787 7.11391 101.467 7.92102 103.25 9.54464L100.402 13.3785C99.4866 12.3696 98.3463 11.8628 96.9902 11.8628C95.634 11.8628 94.597 12.3132 93.6819 13.2189C92.7669 14.1199 92.3117 15.2179 92.3117 16.5084C92.3117 17.7988 92.7669 18.9016 93.6819 19.8166C94.597 20.7317 95.6997 21.1869 96.9902 21.1869C98.3979 21.1869 99.557 20.6472 100.472 19.5679L103.499 23.2985L103.494 23.3032Z" fill="white"/>
            <path d="M109.416 25.4993V13.0265H106.277V8.4982H109.416C109.529 6.10031 110.284 4.29837 111.678 3.09239C113.072 1.88171 115.188 1.19661 118.022 1.03706L120.045 0.933823L120.383 5.32135L118.829 5.42458C117.525 5.51844 116.628 5.75776 116.145 6.15193C115.662 6.5461 115.422 7.15144 115.422 7.98202V8.4982H119.608V13.0265H115.422V25.4993H109.416Z" fill="#25FF58"/>
            <path d="M121.396 25.4993V8.49821H127.234V11.3654C127.999 9.40856 129.65 8.33866 132.194 8.15096L133.845 8.01488L134.183 13.2001L130.913 13.5099C129.721 13.6272 128.853 13.965 128.313 14.5281C127.773 15.0912 127.501 15.9265 127.501 17.0339V25.4993H121.396Z" fill="#25FF58"/>
            <path d="M135.699 7.62939e-06H142.006V5.56068H135.699V7.62939e-06ZM135.868 8.49821H141.874V25.4993H135.868V8.49821Z" fill="#25FF58"/>
            <path d="M151.658 25.8794C150.241 25.8794 148.988 25.5228 147.895 24.8095C146.802 24.0962 145.948 23.0686 145.333 21.7359C144.713 20.3985 144.404 18.8218 144.404 17.0011C144.404 15.1804 144.713 13.5755 145.333 12.2522C145.952 10.9289 146.806 9.91066 147.895 9.1927C148.984 8.47943 150.241 8.1228 151.658 8.1228C152.714 8.1228 153.69 8.34804 154.577 8.79853C155.464 9.24901 156.144 9.83089 156.618 10.5442V1.14499H162.625V25.504H156.754V23.153C156.327 23.9836 155.652 24.6452 154.732 25.138C153.808 25.6307 152.785 25.8794 151.663 25.8794M153.582 21.3558C154.483 21.3558 155.225 21.0085 155.811 20.3187C156.398 19.6289 156.689 18.5215 156.689 17.0011C156.689 15.4807 156.398 14.3451 155.811 13.6647C155.225 12.9843 154.483 12.6464 153.582 12.6464C152.681 12.6464 151.907 12.9843 151.32 13.6647C150.734 14.3451 150.443 15.4572 150.443 17.0011C150.443 18.5449 150.734 19.6289 151.32 20.3187C151.907 21.0085 152.658 21.3558 153.582 21.3558Z" fill="#25FF58"/>
            <path d="M171.7 25.8794C170.419 25.8794 169.288 25.6354 168.308 25.152C167.331 24.6687 166.562 24.0071 166.013 23.1671C165.459 22.3271 165.187 21.3652 165.187 20.2812C165.187 19.0611 165.501 18.0851 166.13 17.3624C166.759 16.6351 167.773 16.1189 169.166 15.8092C170.56 15.4995 172.418 15.3446 174.732 15.3446H176.013V14.8613C176.013 14.0307 175.806 13.4441 175.389 13.0969C174.971 12.7497 174.258 12.5807 173.244 12.5807C172.39 12.5807 171.442 12.7168 170.41 12.9937C169.373 13.2705 168.364 13.6975 167.374 14.27L165.853 10.2251C166.416 9.81212 167.134 9.44141 168.012 9.11762C168.889 8.79384 169.809 8.54983 170.78 8.3762C171.747 8.20258 172.658 8.11811 173.512 8.11811C176.28 8.11811 178.331 8.72814 179.668 9.9482C181.006 11.1683 181.677 13.0922 181.677 15.72V25.4993H176.074V23.0826C175.783 23.9601 175.252 24.6452 174.488 25.138C173.723 25.6307 172.789 25.8794 171.686 25.8794M173.052 21.872C173.882 21.872 174.586 21.5951 175.159 21.0414C175.731 20.4877 176.017 19.765 176.017 18.864V18.2399H174.736C173.408 18.2399 172.437 18.3854 171.818 18.6716C171.198 18.9626 170.888 19.4131 170.888 20.0372C170.888 20.5674 171.071 21.0038 171.447 21.3511C171.818 21.6983 172.352 21.8673 173.052 21.8673" fill="#25FF58"/>
            <path d="M185.773 31.7216L189.11 24.3262L182.329 8.49821H188.64L192.282 18.1414L196.064 8.49821H202L191.845 31.7216H185.773Z" fill="#25FF58"/>
          </svg>

          <p>
            <b>última semana.</b> garanta antes que esgote!
          </p>
        </div>

        {tempoRestante ? (
          <div className={`${style.cronometroContainer}`}>
            <div className={`${style.containerNumber}`}>
              <p className={`${style.numberCronometro}`}>
                {String(tempoRestante.dias).padStart(2, '0')}
              </p>
              Dias
            </div>
            <div className={`${style.numberSeparator}`}>:</div>
            <div className={`${style.containerNumber}`}>
              <p className={`${style.numberCronometro}`}>
                {String(tempoRestante.horas).padStart(2, '0')}
              </p>{' '}
              Horas
            </div>
            <div className={`${style.numberSeparator}`}>:</div>
            <div className={`${style.containerNumber}`}>
              <p className={`${style.numberCronometro}`}>
                {String(tempoRestante.minutos).padStart(2, '0')}
              </p>{' '}
              {isMobile ? 'Min' : 'Minutos'}
            </div>
            <div className={`${style.numberSeparator}`}>:</div>
            <div className={`${style.containerNumber}`}>
              <p className={`${style.numberCronometro}`}>
                {String(tempoRestante.segundos).padStart(2, '0')}
              </p>{' '}
              {isMobile ? 'Seg' : 'Segundos'}
            </div>
          </div>
        ) : (
          // Loading state
          <div className={`${style.cronometroContainer}`}>
            <div
              className={`${style.containerNumberLoading} ${style.containerNumber}`}
            >
              <p
                className={`${style.numberCronometro} ${style.numberCronometroLoading}`}
              />{' '}
              Dias
            </div>
            <div className={`${style.numberSeparator}`}>:</div>
            <div
              className={`${style.containerNumberLoading} ${style.containerNumber}`}
            >
              <p
                className={`${style.numberCronometro} ${style.numberCronometroLoading}`}
              />{' '}
              Horas
            </div>
            <div className={`${style.numberSeparator}`}>:</div>
            <div
              className={`${style.containerNumberLoading} ${style.containerNumber}`}
            >
              <p
                className={`${style.numberCronometro} ${style.numberCronometroLoading}`}
              />{' '}
              Min
            </div>
            <div className={`${style.numberSeparator} ${style.deskOnly}`}>
              :
            </div>
            <div
              className={`${style.containerNumberLoading} ${style.containerNumber} ${style.deskOnly}`}
            >
              <p
                className={`${style.numberCronometro} ${style.numberCronometroLoading}`}
              />{' '}
              Seg
            </div>
          </div>
        )}
      </div>
    </a>
  )
}

Countdown.schema = {
  title: 'Cronometro para o evento',
  description: 'Configuração do contador regressivo',
  type: 'object',
  properties: {
    targetDate: {
      title: 'Data do evento',
      description: 'Colocar a data no formato: "dd/mm/aaaa" (Ex: 31/12/2024)',
      type: 'string',
      default: null,
    },
    url: {
      title: 'Link do evento',
      description: 'Link para onde o usuário será redirecionado ao clicar no cronômetro. Ex ("/black-friday")',
      type: 'string',
      default: 'null',
    }
  },
}
